<?php
include 'HeaderTemplate.php';
?>
    <div class="content-container">
        <h1>Тестове завдання (PHP)</h1>

        <h2>Інформація про фільм:</h2>
        <ol>
            <li>Унікальний ідентифікатор</li>
            <li>Назва фільму</li>
            <li>Рік випуску</li>
            <li>Формат (VHS, DVD, Blu-ray)</li>
            <li>Список акторів (“Ім'я та прізвище актора”)</li>
        </ol>

        <h2>Функції, які має підтримувати система:</h2>
        <ol>
            <li>Авторизація користувача</li>
            <li>Додати фільм</li>
            <li>Видалити фільм</li>
            <li>Показати інформацію про фільм</li>
            <li>Показати список фільмів відсортованих за назвою в алфавітному порядку</li>
            <li>Знайти фільм за назвою</li>
            <li>Знайти фільм на ім'я актора</li>
            <li>Імпорт фільмів із текстового файлу (приклад файлу надається “sample_movies.txt”)</li>
        </ol>

        <p>Насамперед важливо, щоб була реалізована вся функціональність з погляду користувача.</p>

        <p>Завдання необхідно реалізувати на PHP. Дані повинні зберігатися у базі даних MySQL. Без використання
            фреймворків.
            Проект повинен запускатись на PHP local server.</p>

        <p>В описі проекту має бути детальна інформація про те, як запускати проект: як розгорнути Б.Д., файл
            конфігурації
            тощо.</p>
    </div>
<?php
include 'FooterTemplate.php';
?>